Autodesk.Revit.DB.FilterOperatorAndTextString.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilterOperatorAndTextString.FilterOperatorStr
A text string denoting the filter operator.
Since:
2019

Autodesk.Revit.DB.FilterOperatorAndTextString.OperatorType
The filter operator.
Since:
2019

Autodesk.Revit.DB.FilterOperatorAndTextString
An instance of this class holds a filter operator and a text string that denotes
the operator in a particular context. For example, the text string for ScheduleFilterType::LessThan
may be "is less than" for a filter rule based on a parameter with numerical values
or "is below" for a filter rule based on a parameter representing a Level.
Since:
2019